Salmonplus1/OttoClaw-Claudelistener/sdkconfig.defaults.esp32s3
# OttoClaw - ESP32-S3 Target Configuration
CONFIG_IDF_TARGET="esp32s3"

# Flash 16MB + QIO
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# CPU 240MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# PSRAM 8MB Octal
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=2048
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=98304
CONFIG_SPIRAM_MEMTEST=n

# WiFi memory optimization
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=3
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_RX_BA_WIN=3
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16

# TLS optimization (PSRAM allocation + small buffers)
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096

# WebSocket support
CONFIG_HTTPD_WS_SUPPORT=y

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Console/UART for CLI - use UART0 so board boots without USB
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Task watchdog timeout - large enough for LLM HTTP calls (can take 60-120s)
CONFIG_ESP_TASK_WDT_TIMEOUT_S=120
CONFIG_TASK_WDT_TIMEOUT_S=120

# LVGL configuration - minimal for memory saving
CONFIG_LV_USE_FLEX=y
CONFIG_LV_USE_SCROLLBAR=y
CONFIG_LV_USE_ANIM=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_USE_LABEL=y
CONFIG_LV_USE_OBJ=y
CONFIG_LV_USE_OBJ_POS=y
CONFIG_LV_USE_OBJ_SIZE=y
CONFIG_LV_USE_OBJ_STYLE=y
CONFIG_LV_USE_OBJ_TREE=y
CONFIG_LV_USE_CANVAS=y
CONFIG_LV_USE_WIDGETS=y
